[
  {
    "habitLabel": "Financial Balance",
    "evidence": "Last 30 days' savings rate -0.01 and net cashflow -3 INR",
    "counsel": "Prioritize spending review to build a positive financial buffer",
    "fullText": "- Financial Balance: Evidence: Last 30 days' savings rate -0.01 and net cashflow -3 INR. Counsel: Prioritize spending review to build a positive financial buffer."
  },
  {
    "habitLabel": "Transfer Habits",
    "evidence": "\"Transfer\" category accounts for 252 INR of 253 INR in total expenses",
    "counsel": "Examine the purpose of transfers to distinguish core needs from optional ones",
    "fullText": "- Transfer Habits: Evidence: \"Transfer\" category accounts for 252 INR of 253 INR in total expenses. Counsel: Examine the purpose of transfers to distinguish core needs from optional ones."
  },
  {
    "habitLabel": "High-Value Expense",
    "evidence": "Your largest expense of 250 INR is a single \"Transfer\" transaction",
    "counsel": "Be aware of how significant single transactions affect your overall spending",
    "fullText": "- High-Value Expense: Evidence: Your largest expense of 250 INR is a single \"Transfer\" transaction. Counsel: Be aware of how significant single transactions affect your overall spending."
  },
  {
    "habitLabel": "Spending Mindset",
    "evidence": "All 6 recorded transactions are categorized as \"necessity\"",
    "counsel": "Re-evaluate if every expense truly qualifies as a necessity to uncover saving opportunities",
    "fullText": "- Spending Mindset: Evidence: All 6 recorded transactions are categorized as \"necessity\". Counsel: Re-evaluate if every expense truly qualifies as a necessity to uncover saving opportunities."
  },
  {
    "habitLabel": "Cash Flow Control",
    "evidence": "Last 30 days income was 250 INR, while expenses totaled 253 INR",
    "counsel": "Focus on immediate spending adjustments to ensure your income covers outgoings",
    "fullText": "- Cash Flow Control: Evidence: Last 30 days income was 250 INR, while expenses totaled 253 INR. Counsel: Focus on immediate spending adjustments to ensure your income covers outgoings."
  }
]
