[
  {
    "habitLabel": "Savings Challenge",
    "evidence": "Last 30 days savings rate -0.01; net cashflow -3 INR",
    "counsel": "Prioritize increasing income or reducing expenses to achieve positive savings",
    "fullText": "- Savings Challenge: Last 30 days savings rate -0.01; net cashflow -3 INR; Counsel: Prioritize increasing income or reducing expenses to achieve positive savings."
  },
  {
    "habitLabel": "Transfer Awareness",
    "evidence": "\"Transfer\" category totals 252 INR, 99.6% of 253 INR expenses",
    "counsel": "Review purposes of large transfers for potential adjustments",
    "fullText": "- Transfer Awareness: \"Transfer\" category totals 252 INR, 99.6% of 253 INR expenses; Counsel: Review purposes of large transfers for potential adjustments."
  },
  {
    "habitLabel": "Expense Scrutiny",
    "evidence": "Average transaction amount is 100.5 INR",
    "counsel": "Evaluate the value and necessity of each individual outlay",
    "fullText": "- Expense Scrutiny: Average transaction amount is 100.5 INR; Counsel: Evaluate the value and necessity of each individual outlay."
  },
  {
    "habitLabel": "Budget Balancing",
    "evidence": "Last 30 days income 250 INR, total expense 253 INR",
    "counsel": "Carefully monitor daily spending to stay within current income",
    "fullText": "- Budget Balancing: Last 30 days income 250 INR, total expense 253 INR; Counsel: Carefully monitor daily spending to stay within current income."
  },
  {
    "habitLabel": "Essential Spending",
    "evidence": "All 6 transactions are tagged as \"necessity\"",
    "counsel": "Continue prioritizing essentials while exploring cost-effective alternatives",
    "fullText": "- Essential Spending: All 6 transactions are tagged as \"necessity\"; Counsel: Continue prioritizing essentials while exploring cost-effective alternatives."
  },
  {
    "habitLabel": "Weekday Spending",
    "evidence": "Largest expense of 250 INR occurred on a Tuesday",
    "counsel": "Note patterns in spending days to plan future outlays",
    "fullText": "- Weekday Spending: Largest expense of 250 INR occurred on a Tuesday; Counsel: Note patterns in spending days to plan future outlays."
  },
  {
    "habitLabel": "Income Stability",
    "evidence": "Lifetime income 350 INR vs. 250 INR in last 30 days",
    "counsel": "Understand income sources to better anticipate financial flows",
    "fullText": "- Income Stability: Lifetime income 350 INR vs. 250 INR in last 30 days; Counsel: Understand income sources to better anticipate financial flows."
  }
]
