[
  {
    "habitLabel": "Savings Management",
    "evidence": "Last 30 days savings rate -0.01 with a -3 INR net cashflow",
    "counsel": "Prioritize achieving a positive savings rate",
    "fullText": "- Savings Management: Last 30 days savings rate -0.01 with a -3 INR net cashflow; Counsel: Prioritize achieving a positive savings rate."
  },
  {
    "habitLabel": "Transfer Spending",
    "evidence": "INR 252 out of INR 253 total expense is categorized as \"Transfer\"",
    "counsel": "Understand the purpose of these transfers for better budgeting",
    "fullText": "- Transfer Spending: INR 252 out of INR 253 total expense is categorized as \"Transfer\"; Counsel: Understand the purpose of these transfers for better budgeting."
  },
  {
    "habitLabel": "Major Outlays",
    "evidence": "The largest single expense was INR 250, making up most of the INR 253 total expense",
    "counsel": "Plan for large expenses to mitigate their impact on cash flow",
    "fullText": "- Major Outlays: The largest single expense was INR 250, making up most of the INR 253 total expense; Counsel: Plan for large expenses to mitigate their impact on cash flow."
  },
  {
    "habitLabel": "Spending Definition",
    "evidence": "All 6 transactions are tagged as \"necessity\"",
    "counsel": "Review if every expense truly qualifies as a necessity",
    "fullText": "- Spending Definition: All 6 transactions are tagged as \"necessity\"; Counsel: Review if every expense truly qualifies as a necessity."
  },
  {
    "habitLabel": "Expense Clarity",
    "evidence": "INR 100 was spent on \"Transportation\" but is not included in the INR 253 expense total",
    "counsel": "Categorize all outflows as expenses for a complete financial view",
    "fullText": "- Expense Clarity: INR 100 was spent on \"Transportation\" but is not included in the INR 253 expense total; Counsel: Categorize all outflows as expenses for a complete financial view."
  },
  {
    "habitLabel": "Budget Balance",
    "evidence": "Last 30 days income INR 250 vs. expense INR 253, resulting in -3 INR net cashflow",
    "counsel": "Seek to increase income or reduce spending to improve cash flow",
    "fullText": "- Budget Balance: Last 30 days income INR 250 vs. expense INR 253, resulting in -3 INR net cashflow; Counsel: Seek to increase income or reduce spending to improve cash flow."
  }
]
