[
  {
    "habitLabel": "Budget Balance",
    "evidence": "Last 30 days savings rate -0.01 with INR 3 net negative cashflow",
    "counsel": "Aim for positive cash flow by reviewing recent spending habits",
    "fullText": "- Budget Balance: Last 30 days savings rate -0.01 with INR 3 net negative cashflow. Counsel: Aim for positive cash flow by reviewing recent spending habits."
  },
  {
    "habitLabel": "Expense Clarity",
    "evidence": "\"Transfer\" category accounts for INR 252 of INR 253 total expense",
    "counsel": "Detail transfer purposes for accurate spending insights",
    "fullText": "- Expense Clarity: \"Transfer\" category accounts for INR 252 of INR 253 total expense. Counsel: Detail transfer purposes for accurate spending insights."
  },
  {
    "habitLabel": "Record Keeping",
    "evidence": "Only 6 transactions are recorded for your lifetime activity",
    "counsel": "Regularly log all financial activities to ensure a complete overview",
    "fullText": "- Record Keeping: Only 6 transactions are recorded for your lifetime activity. Counsel: Regularly log all financial activities to ensure a complete overview."
  },
  {
    "habitLabel": "Spending Awareness",
    "evidence": "Your average transaction amount is INR 100.5",
    "counsel": "Examine larger transactions to find potential savings opportunities",
    "fullText": "- Spending Awareness: Your average transaction amount is INR 100.5. Counsel: Examine larger transactions to find potential savings opportunities."
  },
  {
    "habitLabel": "Essential Spending",
    "evidence": "All 6 recorded transactions are flagged as 'necessity'",
    "counsel": "Scrutinize each 'necessity' to confirm its essential status",
    "fullText": "- Essential Spending: All 6 recorded transactions are flagged as 'necessity'. Counsel: Scrutinize each 'necessity' to confirm its essential status."
  },
  {
    "habitLabel": "Income Alignment",
    "evidence": "Your last 30 days income (INR 250) is slightly less than expenses (INR 253)",
    "counsel": "Align your income and expenses to achieve a positive balance",
    "fullText": "- Income Alignment: Your last 30 days income (INR 250) is slightly less than expenses (INR 253). Counsel: Align your income and expenses to achieve a positive balance."
  }
]
