[
  {
    "habitLabel": "Spending Trend",
    "evidence": "Negative savings rate. Evidence: Last 30 days savings rate -0.01 and net cashflow -3 INR",
    "counsel": "Focus on aligning income with expenses to build a positive saving habit",
    "fullText": "- Spending Trend: Negative savings rate. Evidence: Last 30 days savings rate -0.01 and net cashflow -3 INR. Counsel: Focus on aligning income with expenses to build a positive saving habit."
  },
  {
    "habitLabel": "Expense Concentration",
    "evidence": "Transfers dominate spending. Evidence: \"Transfer\" category is 252 INR out of 253 INR total expense",
    "counsel": "Categorize transfers clearly to understand their true purpose",
    "fullText": "- Expense Concentration: Transfers dominate spending. Evidence: \"Transfer\" category is 252 INR out of 253 INR total expense. Counsel: Categorize transfers clearly to understand their true purpose."
  },
  {
    "habitLabel": "Intentional Spending",
    "evidence": "All transactions are marked as necessities. Evidence: All 6 transactions are tagged \"necessity\"",
    "counsel": "Continue purposeful spending; review if all items genuinely qualify as necessities",
    "fullText": "- Intentional Spending: All transactions are marked as necessities. Evidence: All 6 transactions are tagged \"necessity\". Counsel: Continue purposeful spending; review if all items genuinely qualify as necessities."
  },
  {
    "habitLabel": "Data Availability",
    "evidence": "Limited transaction history. Evidence: Only 6 total transactions recorded",
    "counsel": "Link more accounts or manually add transactions for richer financial insights",
    "fullText": "- Data Availability: Limited transaction history. Evidence: Only 6 total transactions recorded. Counsel: Link more accounts or manually add transactions for richer financial insights."
  },
  {
    "habitLabel": "Cashflow Management",
    "evidence": "Slight cash outflow in the last 30 days. Evidence: Last 30 days net cashflow -3 INR",
    "counsel": "Monitor daily expenses to prevent future negative cashflow",
    "fullText": "- Cashflow Management: Slight cash outflow in the last 30 days. Evidence: Last 30 days net cashflow -3 INR. Counsel: Monitor daily expenses to prevent future negative cashflow."
  },
  {
    "habitLabel": "Lifetime Balance",
    "evidence": "Income generally covers expenses. Evidence: Total income 350 INR vs. total expense 253 INR",
    "counsel": "Maintain this positive balance and aim to increase your savings margin",
    "fullText": "- Lifetime Balance: Income generally covers expenses. Evidence: Total income 350 INR vs. total expense 253 INR. Counsel: Maintain this positive balance and aim to increase your savings margin."
  }
]
