[
  {
    "habitLabel": "Budgetary Balance",
    "evidence": "Last 30 days savings rate -0.01 and net cashflow -3 INR",
    "counsel": "Aim to increase income or reduce expenses to achieve positive savings",
    "fullText": "- Budgetary Balance: Last 30 days savings rate -0.01 and net cashflow -3 INR; Counsel: Aim to increase income or reduce expenses to achieve positive savings."
  },
  {
    "habitLabel": "Expense Focus",
    "evidence": "252 INR of 253 INR total expense is from 'Transfer' category",
    "counsel": "Review 'Transfer' details to identify spending patterns",
    "fullText": "- Expense Focus: 252 INR of 253 INR total expense is from 'Transfer' category; Counsel: Review 'Transfer' details to identify spending patterns."
  },
  {
    "habitLabel": "High-Impact Spending",
    "evidence": "One 250 INR transaction makes up 98.8% of total expenses",
    "counsel": "Be mindful of large, infrequent transfers and their impact on cash flow",
    "fullText": "- High-Impact Spending: One 250 INR transaction makes up 98.8% of total expenses; Counsel: Be mindful of large, infrequent transfers and their impact on cash flow."
  },
  {
    "habitLabel": "Data Clarity",
    "evidence": "A 100 INR \"Transportation\" transaction exists but isn't classified as an expense",
    "counsel": "Ensure all outflows are correctly categorized to track true spending",
    "fullText": "- Data Clarity: A 100 INR \"Transportation\" transaction exists but isn't classified as an expense; Counsel: Ensure all outflows are correctly categorized to track true spending."
  },
  {
    "habitLabel": "Essential Spending",
    "evidence": "All 6 transactions are tagged with the 'necessity' flavor",
    "counsel": "Carefully examine if every 'necessity' can be optimized for savings",
    "fullText": "- Essential Spending: All 6 transactions are tagged with the 'necessity' flavor; Counsel: Carefully examine if every 'necessity' can be optimized for savings."
  },
  {
    "habitLabel": "Income-Expense Alignment",
    "evidence": "Last 30 days income (250 INR) closely matches the largest expense (250 INR)",
    "counsel": "Strive to earn more than your largest single necessary expenditure",
    "fullText": "- Income-Expense Alignment: Last 30 days income (250 INR) closely matches the largest expense (250 INR); Counsel: Strive to earn more than your largest single necessary expenditure."
  }
]
