[
  {
    "habitLabel": "Financial Balance",
    "evidence": "Needs attention; Evidence: Last 30 days savings rate is -0.01 and net cashflow is -3 INR",
    "counsel": "Actively balance income and expenses to avoid a deficit",
    "fullText": "- Financial Balance: Needs attention; Evidence: Last 30 days savings rate is -0.01 and net cashflow is -3 INR; Counsel: Actively balance income and expenses to avoid a deficit."
  },
  {
    "habitLabel": "Transfer Tracking",
    "evidence": "High importance; Evidence: Transfers account for 252 INR of 253 INR total expense",
    "counsel": "Clearly categorize the purpose of these significant transfers",
    "fullText": "- Transfer Tracking: High importance; Evidence: Transfers account for 252 INR of 253 INR total expense; Counsel: Clearly categorize the purpose of these significant transfers."
  },
  {
    "habitLabel": "Major Outflow Insight",
    "evidence": "Dominant; Evidence: The largest expense was a 250 INR transfer",
    "counsel": "Understand why this major transfer occurred",
    "fullText": "- Major Outflow Insight: Dominant; Evidence: The largest expense was a 250 INR transfer; Counsel: Understand why this major transfer occurred."
  },
  {
    "habitLabel": "Necessity Focus",
    "evidence": "Consistent; Evidence: All 6 transactions are tagged as 'necessity'",
    "counsel": "Continue to prioritize essential spending effectively",
    "fullText": "- Necessity Focus: Consistent; Evidence: All 6 transactions are tagged as 'necessity'; Counsel: Continue to prioritize essential spending effectively."
  },
  {
    "habitLabel": "Tracking Habits",
    "evidence": "Emerging; Evidence: Only 6 transactions recorded in total",
    "counsel": "Maintain diligent tracking to build a comprehensive financial history",
    "fullText": "- Tracking Habits: Emerging; Evidence: Only 6 transactions recorded in total; Counsel: Maintain diligent tracking to build a comprehensive financial history."
  },
  {
    "habitLabel": "Cash Flow Stability",
    "evidence": "Fragile; Evidence: Last 30 days income (250 INR) is slightly less than expenses (253 INR)",
    "counsel": "Aim to generate more income or reduce minor expenses",
    "fullText": "- Cash Flow Stability: Fragile; Evidence: Last 30 days income (250 INR) is slightly less than expenses (253 INR); Counsel: Aim to generate more income or reduce minor expenses."
  }
]
