[
  {
    "habitLabel": "Budget Balance",
    "evidence": "Last 30 days income INR 250, expense INR 253, leading to a -0.01 savings rate",
    "counsel": "Prioritize reducing spending to achieve a positive savings rate",
    "fullText": "- Budget Balance: Last 30 days income INR 250, expense INR 253, leading to a -0.01 savings rate. Counsel: Prioritize reducing spending to achieve a positive savings rate."
  },
  {
    "habitLabel": "Category Clarity",
    "evidence": "\"Transfer\" category accounts for INR 252 of your INR 253 total expense",
    "counsel": "Review the nature of these transfers to understand where your money goes",
    "fullText": "- Category Clarity: \"Transfer\" category accounts for INR 252 of your INR 253 total expense. Counsel: Review the nature of these transfers to understand where your money goes."
  },
  {
    "habitLabel": "Transaction Impact",
    "evidence": "Your largest single expense was INR 250 (a transfer)",
    "counsel": "Be aware of how single large transactions influence your overall cash flow",
    "fullText": "- Transaction Impact: Your largest single expense was INR 250 (a transfer). Counsel: Be aware of how single large transactions influence your overall cash flow."
  },
  {
    "habitLabel": "Income Awareness",
    "evidence": "You received INR 250 as income in the last 30 days",
    "counsel": "Maintain a clear view of your income sources for financial planning",
    "fullText": "- Income Awareness: You received INR 250 as income in the last 30 days. Counsel: Maintain a clear view of your income sources for financial planning."
  },
  {
    "habitLabel": "Complete Tracking",
    "evidence": "An INR 100 transportation transaction is not in the INR 253 total expense",
    "counsel": "Ensure all spending is categorized as expense for accurate financial analysis",
    "fullText": "- Complete Tracking: An INR 100 transportation transaction is not in the INR 253 total expense. Counsel: Ensure all spending is categorized as expense for accurate financial analysis."
  },
  {
    "habitLabel": "Data Enrichment",
    "evidence": "Your financial history contains only 6 transactions",
    "counsel": "Continue logging all transactions to build a more comprehensive spending profile",
    "fullText": "- Data Enrichment: Your financial history contains only 6 transactions. Counsel: Continue logging all transactions to build a more comprehensive spending profile."
  }
]
