[
  {
    "habitLabel": "Cashflow Management",
    "evidence": "Strive for positive cashflow by balancing income and expenses. Evidence: Last 30 days net cashflow is -3 INR",
    "counsel": "Prioritize increasing income or reducing expenses",
    "fullText": "- Cashflow Management: Strive for positive cashflow by balancing income and expenses. Evidence: Last 30 days net cashflow is -3 INR. Counsel: Prioritize increasing income or reducing expenses."
  },
  {
    "habitLabel": "Transfer Spending",
    "evidence": "Examine \"Transfer\" expenses to understand their necessity and frequency. Evidence: INR 252 of 253 total expenses are categorized as \"Transfer.\"",
    "counsel": "Categorize transfers clearly for better insight",
    "fullText": "- Transfer Spending: Examine \"Transfer\" expenses to understand their necessity and frequency. Evidence: INR 252 of 253 total expenses are categorized as \"Transfer.\" Counsel: Categorize transfers clearly for better insight."
  },
  {
    "habitLabel": "Transaction Visibility",
    "evidence": "Consistently record all transactions for a complete financial overview. Evidence: Only 6 transactions recorded lifetime",
    "counsel": "Aim to log all financial activities for accurate tracking",
    "fullText": "- Transaction Visibility: Consistently record all transactions for a complete financial overview. Evidence: Only 6 transactions recorded lifetime. Counsel: Aim to log all financial activities for accurate tracking."
  },
  {
    "habitLabel": "Spend Impact",
    "evidence": "Reflect on the impact of individual transactions on your budget. Evidence: Average transaction amount is INR 100.5",
    "counsel": "Review if each spend aligns with your financial goals",
    "fullText": "- Spend Impact: Reflect on the impact of individual transactions on your budget. Evidence: Average transaction amount is INR 100.5. Counsel: Review if each spend aligns with your financial goals."
  },
  {
    "habitLabel": "Essential Purchases",
    "evidence": "Maintain focus on essential spending and explore ways to optimize it. Evidence: All 6 transactions are tagged as \"necessity.\"",
    "counsel": "Continue to prioritize needs over wants",
    "fullText": "- Essential Purchases: Maintain focus on essential spending and explore ways to optimize it. Evidence: All 6 transactions are tagged as \"necessity.\" Counsel: Continue to prioritize needs over wants."
  },
  {
    "habitLabel": "Weekly Expense Pattern",
    "evidence": "Anticipate and plan for significant spending that occurs on Tuesdays. Evidence: INR 250 of expense occurred on Tuesday",
    "counsel": "Review Tuesday spending habits for opportunities",
    "fullText": "- Weekly Expense Pattern: Anticipate and plan for significant spending that occurs on Tuesdays. Evidence: INR 250 of expense occurred on Tuesday. Counsel: Review Tuesday spending habits for opportunities."
  }
]
