[
  {
    "habitLabel": "Spending Equilibrium",
    "evidence": "Net cash flow of -3 INR in last 30 days",
    "counsel": "Review all transactions to identify minor leaks in spending",
    "fullText": "- Spending Equilibrium: Net cash flow of -3 INR in last 30 days; Counsel: Review all transactions to identify minor leaks in spending."
  },
  {
    "habitLabel": "Savings Outlook",
    "evidence": "Savings rate is -0.01 in the last 30 days",
    "counsel": "Prioritize increasing income or reducing expenses to build savings",
    "fullText": "- Savings Outlook: Savings rate is -0.01 in the last 30 days; Counsel: Prioritize increasing income or reducing expenses to build savings."
  },
  {
    "habitLabel": "Transfer Dependency",
    "evidence": "'Transfer' category comprises 252 INR of the 253 INR total expense",
    "counsel": "Understand the purpose of these transfers to manage future spending",
    "fullText": "- Transfer Dependency: 'Transfer' category comprises 252 INR of the 253 INR total expense; Counsel: Understand the purpose of these transfers to manage future spending."
  },
  {
    "habitLabel": "Large Single Outlay",
    "evidence": "Your largest expense was a single 250 INR transfer",
    "counsel": "Monitor large transactions closely to ensure they align with your financial goals",
    "fullText": "- Large Single Outlay: Your largest expense was a single 250 INR transfer; Counsel: Monitor large transactions closely to ensure they align with your financial goals."
  },
  {
    "habitLabel": "Necessity Focus",
    "evidence": "All 6 transactions are tagged as 'necessity'",
    "counsel": "This indicates mindful spending on essentials; continue to prioritize needs",
    "fullText": "- Necessity Focus: All 6 transactions are tagged as 'necessity'; Counsel: This indicates mindful spending on essentials; continue to prioritize needs."
  },
  {
    "habitLabel": "Income-Expense Balance",
    "evidence": "Your largest expense (250 INR) matches your last 30-day income (250 INR)",
    "counsel": "Aim to generate income exceeding major expenses to build a buffer",
    "fullText": "- Income-Expense Balance: Your largest expense (250 INR) matches your last 30-day income (250 INR); Counsel: Aim to generate income exceeding major expenses to build a buffer."
  }
]
