[
  {
    "habitLabel": "Savings Improvement",
    "evidence": "Last 30 days savings rate is -0.01",
    "counsel": "Aim for a positive savings rate by adjusting income or expenses",
    "fullText": "- Savings Improvement: Last 30 days savings rate is -0.01; Counsel: Aim for a positive savings rate by adjusting income or expenses."
  },
  {
    "habitLabel": "Cashflow Management",
    "evidence": "Last 30 days net cashflow is -3 INR",
    "counsel": "Analyze recent outflows to identify opportunities for better cash management",
    "fullText": "- Cashflow Management: Last 30 days net cashflow is -3 INR; Counsel: Analyze recent outflows to identify opportunities for better cash management."
  },
  {
    "habitLabel": "Transfer Spending",
    "evidence": "Transfers account for 252 INR of 253 INR total expenses",
    "counsel": "Clarify the nature of these transfers to understand your core spending",
    "fullText": "- Transfer Spending: Transfers account for 252 INR of 253 INR total expenses; Counsel: Clarify the nature of these transfers to understand your core spending."
  },
  {
    "habitLabel": "Significant Expense",
    "evidence": "Your largest expense was 250 INR, comprising most of your 253 INR total expenses",
    "counsel": "Review the impact of large, infrequent expenses on your budget",
    "fullText": "- Significant Expense: Your largest expense was 250 INR, comprising most of your 253 INR total expenses; Counsel: Review the impact of large, infrequent expenses on your budget."
  },
  {
    "habitLabel": "Financial Visibility",
    "evidence": "All 6 transactions recorded occurred within the last 30 days",
    "counsel": "Continue consistent tracking for a more complete financial overview",
    "fullText": "- Financial Visibility: All 6 transactions recorded occurred within the last 30 days; Counsel: Continue consistent tracking for a more complete financial overview."
  },
  {
    "habitLabel": "Essential Spending",
    "evidence": "All 6 recorded transactions are categorized as \"necessity\"",
    "counsel": "Explore if any essential expenses can be optimized or reduced",
    "fullText": "- Essential Spending: All 6 recorded transactions are categorized as \"necessity\"; Counsel: Explore if any essential expenses can be optimized or reduced."
  }
]
